package com.zsenhe.caideng.data

/**
 * 整理自 https://www.sohu.com/a/253408281_100055815
 */
object SampleData {
    val riddles = listOf(
        Riddle(1, "引进人才留得住", "主", "打一字"),
        Riddle(2, "春荷叶半开", "草", "打一字"),
        Riddle(3, "三十而立念师恩", "莘", "打一字"),
        Riddle(4, "前头无人就叫余", "俞", "打一字"),
        Riddle(5, "恻隐之心人有之", "侧", "打一字"),

        Riddle(101, "爱好旅游", "喜出望外", "打一成语"),
        Riddle(102, "商店老板盼兴旺", "卖主求荣", "打一成语"),
        Riddle(103, "是进亦忧退亦忧", "乐在其中", "打一成语"),
        Riddle(104, "皇家发言人", "替天行道", "打一成语"),
        Riddle(105, "管他三七二十一", "不计其数", "打一成语"),

        Riddle(201, "一只顺风舟，白篷红船头，两把红划桨，拨波随意游", "鹅", "打一动物"),
        Riddle(202, "铜头铁翅膀，飞着不展翅，卧着不合膀", "蜻蜓", "打一动物"),
        Riddle(203, "吃进的是草，挤出的是宝，从来不耕地，功劳却不小", "奶牛", "打一动物"),

        Riddle(301, "身穿绿衫头戴珠，肚内文通不读书", "葱", "打一植物"),
        Riddle(302, "姐妹七八个，手扶栏杆坐，脱了白布衫，马上降灾祸", "蒜", "打一植物"),

        Riddle(401, "方方正正摆中央，知识源泉其中选", "书柜", "打一家具"),
        Riddle(402, "高山砍竹，低处扎屋，穿金带银，低头进门", "轿子", "打一交通工具"),

        Riddle(501, "把手在何方", "巴西", "打二字国家名"),
        Riddle(502, "秋后落日映水巷", "香港", "打中国二字地名"),
    )
}
